tutorials/thermallyInducedFractures/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
}

internalField   nonuniform List<scalar> 
160000
(
0.560803230908122
0.572333724650686
0.402879404443250
0.512041786375536
0.446040036641745
0.442079356893420
0.541864336114297
0.655985524894518
...
)
;


// ************************************************************************* //
