tutorials/thermallyInducedFractures/0/epss
/*--------------------------------*- C++ -*----------------------------------*\
 =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
}

internalField   nonuniform List<scalar>

160000
(
0.550841884855055
0.517079180521488
0.541497536387182
0.502383361235860
0.471167339379102
0.544706967801614
0.479464848239493
0.554803417004395
0.524061909897093
0.452266353550821
0.482796137339045
0.522635604062601
0.459322312307450
0.467278367325897
0.574091205480193
0.532849100208700
0.565974568489415
0.560150547431008
0.484952758014813
0.493229756296943
0.508753017346718
0.526709615363111
0.504061343845185
0.465803897978283
0.489255550956722
0.456763586004182
0.454600792661671
0.503160332455742
0.482590284971519
0.541376421651073
0.543257947335484
0.495220596932137
0.415457950136710
0.489543404491889
0.505975891592971
0.478828283119287
0.467808852388883
0.427249193071602
0.558016623685282
0.505428121807692
0.506131005653103
0.507314692758286
0.476227331191121
0.538044032200592
0.472391069680387
0.477194326798984
0.494320091995726
0.551369923617114
0.485531746505659
0.541383295103716
0.500811840968658
0.420034237433066
0.466243159975784
0.497669669512948
0.431824900026392
0.543138047636507
0.434861022173634
0.563448477253596
0.577023169705875
0.536178777751140
0.384796154809643
0.518229368021350
0.519534341661136
0.544614182385639
0.573648472595782
0.435592802273381
0.483043306704681
0.457436201458266
0.593478311348980
0.656890813543584
0.438587407956004
0.563081022134692
0.455075528173121
0.533443780225654
0.477373640355777
0.504442771140523
0.469273670729677
0.515515311022844
0.440979410361962
0.501197179734290
0.435452494802618
0.408639516972668
0.478593013947235
0.501772475866115
0.505647298501796
0.523059968110526
0.523156611380648
0.567387547307714
0.521793797599194
0.471138715919981
0.571801388685577
0.439882287687383
0.427828695876262
0.450041602768534
0.486191715366790
0.558387977358566
0.493336360072041
0.527200031475073
...
);
// ************************************************************************* //
