tutorials/thermallyInducedFractures/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          320000;
        startFace       319200;
    }
    left
    {
        type            patch;
        nFaces          400;
        startFace       639200;
    }
    right
    {
        type            patch;
        nFaces          400;
        startFace       639600;
    }
    top
    {
        type            patch;
        nFaces          400;
        startFace       640000;
    }
    bottom
    {
        type            patch;
        nFaces          400;
        startFace       640400;
    }
)

// ************************************************************************* //
