tutorials/thermallyInducedFractures/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//1 the represents wetting phase, and 2 represents the nonwetting phase
phases (wetting nonWetting);


//water is wetting, air is nonwetting
wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-06;
    rho             [1 -3 0 0 0 0 0] 1000;
}
nonWetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-05;
    rho             [1 -3 0 0 0 0 0] 1;
}

//thermal properties
// kg m s K mol A cd
kappa_1           [1 1 -3 -1 0 0 0]  0.6; //water heat conductivity
Cp_1           [0 2 -2 -1 0 0 0]  4186; //water specific heat capacity
kappa_2           [1 1 -3 -1 0 0 0]  0.024; //air heat conductivity
Cp_2           [0 2 -2 -1 0 0 0]  700; //air specific heat capacity

kappa_s           [1 1 -3 -1 0 0 0]  1; //solid heat conductivity
Cp_s           [0 2 -2 -1 0 0 0]  1350; //solid specific heat capacity
rho_s           [1 -3 0 0 0 0 0]  2650; //solid density

//// fitting coefficients for fluid density and viscosity
//density of wetting phase (water)
coeff1           [1 -3 0 -2 0 0 0]  -3.5313e-3; 
coeff2           [1 -3 0 -1 0 0 0]  1.8517; 
coeff3           [1 -3 0 0 0 0 0]  7.5847e2; 
//density of nonwetting phase (air)
coeff4           [1 -3 0 -2 0 0 0]  1.6613e-5; 
coeff5           [1 -3 0 -1 0 0 0]  -1.3840e-2; 
coeff6           [1 -3 0 0 0 0 0]  3.8333; 
//dynamic viscosity of wetting phase (water)
coeff7           [1 -1 -1 -2 0 0 0]  1.8357e-7; 
coeff8           [1 -1 -1 -1 0 0 0]  -1.3104e-4; 
coeff9           [1 -1 -1 0 0 0 0]  2.3706e-2; 
//dynamic viscosity of nonwetting phase (air)
coeff10           [1 -1 -1 -2 0 0 0]  -3.5032e-11; 
coeff11           [1 -1 -1 -1 0 0 0]  6.8511e-8; 
coeff12           [1 -1 -1 0 0 0 0]  1.0532e-6; 


//Choose solid rheology model
transportModel  HerschelBulkleyQuemada; 
   
HerschelBulkleyQuemadaCoeffs
{
    nu0      [0 2 -1 0 0 0 0] 1e5;        // viscosity at low stresses      
    tau0     [0 2 -2 0 0 0 0] 1.2;        // yield stress
    epssMax  [0 0 0 0 0 0 0] 0.74;        // maximum solid fraction
    nuf      [0 2 -1 0 0 0 0] 1e-6;       // minimum viscosity 
    Dstar    [0 0 0 0 0 0 0] 1.1;         // fractal exponent
    n        [0 0 0 0 0 0 0] 1;           // power-law exponent
}

activateSolidMechanics         1; //activate solid mechanics?
activateCapillarity            0; //activate capillary model?
activatePorousContactAngle     0; //activate porous contact angle?
theta0                         45; //porous contact angle
activateSwellingPressure       0; //activate swelling pressure?
activateTemperatureDependenceOfProperties  1; //activate temperature dependence for viscosity and density
activateTemperatureDependenceOfCapillarity  1; //activate temperature dependence for capillary pressure
activateTemperatureDependenceOfPermeability  1; //activate temperature dependence for absolute permeability
activatePressureDependenceOfDensityForWettingPhase 0; // activate pressure dependence of density using the ideal gas law for wetting phase
activatePressureDependenceOfDensityForNonWettingPhase 1; // activate pressure dependence of density using the ideal gas law for nonwetting phase


// Volume viscosity model parameters
kappaDyn0      [1 -1 -1 0 0 0 0]   0;    // Base dynamic bulk viscosity [Pa·s]
mCompaction    [0 0 0 0 0 0 0]     2;    // Compaction exponent [-]
Ks          [1 -1 -2 0 0 0 0]     3e7;    // // bulk modulus of solid [Pa]


// Temperature dependence coefficient
sigma            [1 0 -2 0 0 0 0]  0.072; //surface tension
invFk0           [0 -2 0 0 0 0 0]  1.92e4; //2D correction 
T0               [0 0 0 1 0 0 0]   300; //ambient temperature
coeffSigma       [0 0 0 -1 0 0 0]  -2.4743e-3; //change rate of surface tension as a function of temperature


//irriducible saturation
alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
//maximum saturation
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;


relativePermeabilityModel  BrooksAndCorey;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    m 0.8;
}

BrooksAndCoreyCoeffs
{
n 1;
}

// ************************************************************************* //
